# Install apps to /Applications
cask_args appdir: '/Applications'

# We need to install some older casks, due to licensing
tap 'homebrew/cask-versions'

# Vitals
brew 'git'
brew 'coreutils'
brew 'ctags'
brew 'dnsmasq' # Start service with sudo
brew 'gcc'
brew 'imagemagick'
brew 'nginx' # Start service with sudo
brew 'openssl'
cask 'atom'
cask 'iterm2'

# ZSH
brew 'zsh'
brew 'zsh-completions'

# Iaas/Paas
brew 'awscli'

# Docker & K8s
brew 'kubernetes-cli'
brew 'stern'
brew 'tfenv'
cask 'docker'
cask 'lens'

# Databases/datastores
brew 'mysql'      , restart_service: true
brew 'postgresql' , restart_service: true
brew 'redis'      , restart_service: true
brew 'sqlite'
cask 'postico'
cask 'sequel-pro'

# Ruby
brew 'ruby-build'
brew 'rbenv'
brew 'libyaml'
brew 'qt'

# Python
brew 'pyenv'
brew 'pyenv-virtualenv'

# JavaScript
brew 'nodenv'

# Nice-to-have
brew 'git-standup'
brew 'hub'
brew 'htop'
brew 'httpie'
brew 'jq'
brew 'spark'
brew 'tldr'
brew 'tree'
brew 'watch'
brew 'the_silver_searcher'
brew 'wrk'
cask 'insomnia'
cask 'ngrok'
cask 'shimo'
cask 'stoplight-studio'

# Fun
brew 'cowsay'
brew 'hr'
brew 'spark'

# Apps
cask 'caret'
cask 'firefox'
cask 'google-chrome'
cask 'kaleidoscope2'
cask 'messenger'
cask 'notion'
cask 'slack'
cask 'spotify'
cask 'tower'
cask 'vlc'
cask 'whatsapp'

# X11
cask 'xquartz'
